Repository: dmitrytut/fitotrack
Catalog: fitotrack/App_GlobalResources/Training/Training.*.resx
Languages: ru

# ADD_EXERCISE_CURRENT_DAY_STRING
source: Add exercise
ru: Добавить упражнение

# EXERCISE_COMPLEXITY_BEGINNER
source: Beginning Level
ru: Упражнение для начинающих спортсменов

# EXERCISE_COMPLEXITY_INTERMEDIATE
source: Intermediate Level
ru: Упражнение для продвинутых спортсменов

# EXERCISE_COMPLEXITY_INVALID_ID
source: Incorrect identifier of complexity of exercise
ru: Неверный идентификатор сложности упражнения

# EXERCISE_COMPLEXITY_PROFESSIONAL
source: Professional Level
ru: Упражнение для профессиональных спортсменов

# EXERCISE_COMPLEXITY_SKILLED
source: Skilled Level
ru: Упражнение для опытных спортсменов

# EXERCISE_DESCRIPTION_INVALID_LENGHT
source: It is long descriptions of exercise shouldn't to exceed {0} symbols
ru: Длинна описания упражнения не должна превышать {0} символов

# EXERCISE_EQUIPMENT_INVALID_LENGHT
source: It is long descriptions of the necessary equipment shouldn't to exceed {0} symbols
ru: Длинна описания необходимого оборудования не должна превышать {0} символов

# EXERCISE_EXECUTION_INVALID_LENGHT
source: It is long descriptions of performance of exercise shouldn't to exceed {0} symbols
ru: Длинна описания выполнения упражнения не должна превышать {0} символов

# EXERCISE_MUSCLES_INVALID_ID
source: The incorrect identifier of group of loaded muscles
ru: Неверный идентификатор группы нагружаемых мышц

# EXERCISE_MUSCLE_GROUP_ABS
source: Abs
ru: Пресс

# EXERCISE_MUSCLE_GROUP_BACK
source: Back
ru: Спина

# EXERCISE_MUSCLE_GROUP_BICEPS
source: Biceps
ru: Бицепс

# EXERCISE_MUSCLE_GROUP_CARDIO
source: Cardio
ru: Кардио

# EXERCISE_MUSCLE_GROUP_CHEST
source: Chest
ru: Грудь

# EXERCISE_MUSCLE_GROUP_COMMON
source: Common load
ru: Общая нагрузка

# EXERCISE_MUSCLE_GROUP_FOREARMS
source: Forearms
ru: Предплечья

# EXERCISE_MUSCLE_GROUP_GLUTERS
source: Gluters
ru: Ягодицы

# EXERCISE_MUSCLE_GROUP_LOWER_LEGS
source: LowerLegs
ru: Нижние ноги

# EXERCISE_MUSCLE_GROUP_SHOULDERS
source: Shoulders
ru: Плечи

# EXERCISE_MUSCLE_GROUP_TRICEPS
source: Triceps
ru: Трицепс

# EXERCISE_MUSCLE_GROUP_UPPER_LEGS
source: UpperLegs
ru: Верхние ноги

# EXERCISE_TITLE_INVALID_LENGHT
source: It is long names of exercise shouldn't to exceed {0} symbols
ru: Длинна названия упражнения не должна превышать {0} символов

# EXERCISE_TYPE_GAME
source: Game exercises
ru: Игровые упражнения

# EXERCISE_TYPE_INVALID_ID
source: Incorrect exercise identifier
ru: Неверный идентификатор типа упражнения

# EXERCISE_TYPE_KARDIO
source: Kardio (aerobic) exercises
ru: Кардио (аэробные) упражнения

# EXERCISE_TYPE_POWER
source: Power (anaerobic) exercises
ru: Силовые (анаэробные) упражнения

# EXERCISE_TYPE_USER_DEFINED
source: User exercises
ru: Упражнения пользователя

# EXERCISE_VIDEOHTMLCODE_INVALID_LENGHT
source: It is long a HTML code of a player shouldn't to exceed {0} symbols
ru: Длинна HTML-кода плеера не должна превышать {0} символов

# TODAY_TRAINING_PAGE_STRING
source: Today,
ru: Сегодня,

# TRAINING_PAGE_TITLE
source: Tainings
ru: Тренировки

# TRAINING_PROGRAM_CHOOSE_PROGRAM_STRING_PART_1
source: In
ru: В

# TRAINING_PROGRAM_CHOOSE_PROGRAM_STRING_PART_2
source: appropriate section
ru: соответствующем разделе

# TRAINING_PROGRAM_CHOOSE_PROGRAM_STRING_PART_3
source: you can choose the ready plan, edit it or create your own. Also, you can add exercise for this day directly on this page.
ru: вы можете выбрать готовый план, отредактировать его или создать свой. Также, вы можете добавить упражнение на данный день прямо на этой странице.

# TRAINING_PROGRAM_IS_NOT_CHOSEN_STRING
source: Training plan isn't chosen.
ru: Тренировочный план не выбран.

# VIEW_CALENDAR_STRING
source: View calendar
ru: Смотреть календарь
