
namespace fitotrack.Entity.Enums
{
  #region __Перечисление ConstitutionTypes типы телосложений__
  /// <summary>
  /// Типы телосложений.
  /// Normostenic 1 - нормостенический тип, характеризующийся пропорциональными размерами тела и гармоничным развитием костно-мышечной системы
  /// Astenic 2 - астенический тип, который отличается стройным телом, слабым развитием мышечной системы, преобладанием (по сравнению с нормостеническим) продольных размеров тела и размеров грудной клетки над размерами живота; длины конечностей — над длиной туловища
  /// Hyperstenic 3 - гиперстенический тип, отличающийся от нормостенического хорошей упитанностью, длинным туловищем и короткими конечностями, относительным преобладанием поперечных размеров тела, размеров живота над размерами грудной клетки
  /// </summary>
  public enum ConstitutionTypes
  {
    Unknown,
    Normostenic,
    Astenic,
    Hyperstenic
  }
  #endregion
}
