Repository: dmitrytut/fitotrack
Catalog: fitotrack/App_GlobalResources/UserProfile/UserProfile.*.resx
Languages: ru

# ACTIVITY_LEVEL_EXTREMALY_ACTIVE
source: Extremely active
ru: Чрезвычайно активный

# ACTIVITY_LEVEL_EXTREMALY_INACTIVE
source: Extremely inactive
ru: Чрезвычайно неактивный

# ACTIVITY_LEVEL_MODERATELY_ACTIVE
source: Moderately active
ru: Умеренно активный

# ACTIVITY_LEVEL_SEDENTARY
source: Sedentary
ru: Сидячий образ жизни

# ACTIVITY_LEVEL_VIGOROUSLY_ACTIVE
source: Vigorously active
ru: Высоко активный

# BRTHDAY_FIELD_STR
source: Birthday
ru: Дата рождения

# CITY_FIELD_STR
source: City
ru: Город

# COMMON_INFO_BTN_STR
source: Common information
ru: Общая информация

# CONFIRM_PASSWORD_FIELD_STR
source: Repeat new password
ru: Повторите пароль

# CONSTITUTION_FILED_STR
source: Comstitution
ru: Телосложение

# CONSTITUTION_TYPE_ASTENIC
source: Astenic
ru: Астенический тип

# CONSTITUTION_TYPE_HYPERSTENIC
source: Hyperstenic
ru: Гиперстенический тип

# CONSTITUTION_TYPE_NORMOSTENIC
source: Normostenic
ru: Нормостенический тип

# COUNTRY_FIELD_STR
source: Country
ru: Страна

# EDIT_PROFILE_TITLE_STR
source: Edit profile
ru: Редактирование профиля

# FIRST_NAME_FILED_STR
source: First name
ru: Имя

# GENDER_FIELD_STR
source: Sex
ru: Пол

# GENDER_TYPE_FEMALE_STR
source: Female
ru: Женский

# GENDER_TYPE_MALE_STR
source: Male
ru: Мужской

# GENDER_TYPE_SELECT_STR
source: I don't know...
ru: Я еще не определился...

# HEIGHT_FIELD_STR
source: Height
ru: Рост

# HEIGHT_MEASURE_UNIT
source: sm
ru: см

# LAST_NAME_FIELD_STR
source: Last name
ru: Фамилия

# NEW_PASSWORD_FIELD_STR
source: New password
ru: Новый пароль

# PHYSICAL_ACTIVITY_LEVEL_FIELD_STR
source: Physical activity
ru: Физическая активность

# PHYSICAL_PARAM_BTN_STR
source: Physical parameters
ru: Физические параметры

# PRIVATE_PROFILE_CHECKBOX_STR
source: Private profile
ru: Приватный профиль

# PROFILE_PAGE_TITLE_STR
source: User Profile
ru: Профиль пользователя

# PROFILE_SETTINGS_BTN_STR
source: Profile settings
ru: Настройки профиля

# SAVE_CHANGES_BTN_STR
source: Save changes
ru: Сохранить изменения

# SELECT_YOUR_CITY_STR
source: Select your city...
ru: Выберите свой город...

# SELECT_YOUR_CONSTITUTION_STR
source: Select your constitution...
ru: Ваше телосложение...

# SELECT_YOUR_COUNTRY_STR
source: Select your country...
ru: Выберите свою страну...

# SELECT_YOUR_PHYSICAL_ACTIVITY_STR
source: Select your physical activity level...
ru: Ваша физ. активность...

# UPLOAD_PHOTO_STR
source: Upload photo
ru: Загрузить фото

# USER_PROFILE_CHANGE_EMAIL_ERROR_EXIST
source: This email address is already registered by other user
ru: Данный адрес email уже зарегестрирован другим пользователем

# USER_PROFILE_CHANGE_EMAIL_ERROR_UNKNOWN
source: It wasn't succeeded to change email (an unknown error)
ru: Не удалось изменить email (неизвестная ошибка)

# USER_PROFILE_CHANGE_EMAIL_SUCCESS
source: Email of the user is successfully changed
ru: Email пользователя успешно изменен

# USER_PROFILE_CHANGE_PASSWORD_SUCCESS
source: The password of the user is successfully changed
ru: Пароль пользователя успешно изменен

# USER_PROFILE_CHECK_PASSWORD_ERROR
source: Incorrect old password
ru: Неверный старый пароль

# USER_PROFILE_INVALID_CITY_ID
source: Invalid identifier of the city
ru: Неверный идентификатор города

# USER_PROFILE_INVALID_CONFIRM_PASSWORD
source: The new password and confirmation of the password don't coincide
ru: Новый пароль и подтверждение пароля не совпадают

# USER_PROFILE_INVALID_CONSTITUTION_ID
source: Invalid identifier of a constitution
ru: Неверный идентификатор телосложения

# USER_PROFILE_INVALID_COUNTRY_ID
source: Invalid identifier of the country
ru: Неверный идентификатор страны

# USER_PROFILE_INVALID_DATE_OF_BIRTH
source: Invalid date of birth
ru: Некорректное значение даты рождения

# USER_PROFILE_INVALID_EMAIL
source: Invalid e-mail address
ru: Некорректный адрес электронной почты

# USER_PROFILE_INVALID_FIRSTNAME_LENGHT
source: It is long a first name shouldn't to exceed {0} symbols
ru: Длинна имени не должна превышать {0} символов

# USER_PROFILE_INVALID_GENDER_ID
source: Invalid identifier of a gender
ru: Неверный идентификатор пола

# USER_PROFILE_INVALID_HEIGHT_VALUE
source: Value of height has to be in the range from {0} cm to {1} cm
ru: Значение роста должно быть в диапазоне от {0} см до {1} см

# USER_PROFILE_INVALID_LASTNAME_LENGHT
source: It is long last name shouldn't to exceed {0} symbols
ru: Длинна фамилии не должна превышать {0} символов

# USER_PROFILE_INVALID_NEW_PASSWORD
source: Invalid password. The password has to contain not less than {0} symbols
ru: Некорректный пароль. Пароль должен содержать не менее {0} символов

# USER_PROFILE_INVALID_OLD_PASSWORD
source: Invalid old password
ru: Неверный старый пароль

# USER_PROFILE_INVALID_PHYSICAL_ACTIVITY_ID
source: Invalid identifier of physical activity
ru: Неверный идентификатор физической активности

# USER_PROFILE_INVALID_WEIGHT_VALUE
source: Value of weight has to be in the range from {0} kg to {1} kg
ru: Значение веса должно быть в диапазоне от {0} кг до {1} кг

# USER_PROFILE_SAVE_DATA_INTERNAL_ERROR
source: Profile data save internal server error
ru: Данные профиля не удалось сохранить из-за внутренней ошибки на сервере

# USER_PROFILE_SAVE_DATA_SUCCESS
source: Profile data are successfully saved
ru: Данные профиля успешно сохранены

# WEIGHT_FIELD_STR
source: Weight
ru: Вес

# WEIGHT_MEASURE_UNIT
source: kg
ru: кг
